versaloon/vsf_orig/vsf/hal/cpu/gd32f1x0/usbd/GD32F1X0_USBD.c
/***************************************************************************
 *   Copyright (C) 2009 - 2010 by Simon Qian <SimonQian@SimonQian.com>     *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, write to the                         *
 *   Free Software Foundation, Inc.,                                       *
 *   59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.             *
 ***************************************************************************/

#include "app_type.h"
#include "compiler.h"
#include "vsfhal.h"

#include "GD32F1X0_USBD.h"

// USB registers
#define RegBase							0x40005C00L
#define PMAAddr							0x40006000L
#define CNTR							((volatile unsigned *)(RegBase + 0x40))
#define ISTR							((volatile unsigned *)(RegBase + 0x44))
#define FNR								((volatile unsigned *)(RegBase + 0x48))
#define DADDR							((volatile unsigned *)(RegBase + 0x4C))
#define BTABLE							((volatile unsigned *)(RegBase + 0x50))
#define EP0REG							((volatile unsigned *)(RegBase))
#	define EPREG_MASK					(USB_EP0R_CTR_RX | USB_EP0R_SETUP | USB_EP0R_EP_TYPE |\
											USB_EP0R_EP_KIND | USB_EP0R_CTR_TX | USB_EP0R_EA)
#	define GetEPReg(ep)					(EP0REG[(ep)] & EPREG_MASK)
#	define SetEPReg(ep, value)			(EP0REG[(ep)] = (value) | USB_EP0R_CTR_RX | USB_EP0R_CTR_TX)
#		define ClearEP_CTR_RX(ep)		(EP0REG[(ep)] = (GetEPReg(ep) & ~USB_EP0R_CTR_RX) | USB_EP0R_CTR_TX)
#		define ToggleDTOG_RX(ep)		SetEPReg((ep), GetEPReg(ep) | USB_EP0R_DTOG_RX)
#		define ClearDTOG_RX(ep)			\
			do {\
				if((EP0REG[(ep)] & USB_EP0R_DTOG_RX) != 0) ToggleDTOG_RX(ep);\
			} while (0)

//#	define USB_EP0R_STAT_RX				0x3000
#		define USB_EPRX_STAT_DIS		0x0000
#		define USB_EPRX_STAT_STALL		0x1000
#		define USB_EPRX_STAT_NAK		0x2000
#		define USB_EPRX_STAT_VALID		0x3000
#		define USB_EPRX_STAT_DTOG1		0x1000
#		define USB_EPRX_STAT_DTOG2		0x2000
//#	define USB_EP0R_EP_TYPE				0x0600
#		define EP_TYPE_MASK				0x0600
#		define EP_BULK					0x0000
#		define EP_CONTROL				0x0200
#		define EP_ISOCHRONOUS			0x0400
#		define EP_INTERRUPT				0x0600

#		define SetEP_KIND(ep)			SetEPReg((ep), GetEPReg(ep) | USB_EP0R_EP_KIND)
#		define ClearEP_KIND(ep)			SetEPReg((ep), GetEPReg(ep) & ~USB_EP0R_EP_KIND)
#		define ClearStatusOut(ep)		ClearEP_KIND(ep)
#		define ClearEPDoubleBuff(ep)	ClearEP_KIND(ep)
#		define SetEPDoubleBuff(ep)		SetEP_KIND(ep)
#		define ClearEP_CTR_TX(ep)		(EP0REG[(ep)] = (GetEPReg(ep) & ~USB_EP0R_CTR_TX) | USB_EP0R_CTR_RX)
#		define ToggleDTOG_TX(ep)		SetEPReg((ep), GetEPReg(ep) | USB_EP0R_DTOG_TX)
#		define ClearDTOG_TX(ep)			\
			do {\
				if((EP0REG[(ep)] & USB_EP0R_DTOG_TX) != 0) ToggleDTOG_TX(ep);\
			} while (0)

//#	define USB_EP0R_STAT_TX				0x0030
#		define USB_EPTX_STAT_DIS		0x0000
#		define USB_EPTX_STAT_STALL		0x0010
#		define USB_EPTX_STAT_NAK		0x0020
#		define USB_EPTX_STAT_VALID		0x0030
#		define USB_EPTX_STAT_DTOG1		0x0010
#		define USB_EPTX_STAT_DTOG2		0x0020

#	define SetEPAddress(ep, addr)		SetEPReg((ep), GetEPReg(ep) | (addr))
#	define SetEPType(ep, type)			SetEPReg((ep), ((GetEPReg(ep) & ~EP_TYPE_MASK) | (type)))

// endpoint buffer
#	define _pEPTxAddr(ep)				((uint32_t *)(((uint16_t)*BTABLE + (ep) * 8 + 0) * 2 + PMAAddr))
#	define _pEPTxCount(ep)				((uint32_t *)(((uint16_t)*BTABLE + (ep) * 8 + 2) * 2 + PMAAddr))
#	define _pEPRxAddr(ep)				((uint32_t *)(((uint16_t)*BTABLE + (ep) * 8 + 4) * 2 + PMAAddr))
#	define _pEPRxCount(ep)				((uint32_t *)(((uint16_t)*BTABLE + (ep) * 8 + 6) * 2 + PMAAddr))

#	define GetEPTxAddr(ep)				((uint16_t)*_pEPTxAddr(ep))
#	define GetEPRxAddr(ep)				((uint16_t)*_pEPRxAddr(ep))
#	define GetEPDblBuf0Addr(ep)			GetEPTxAddr(ep)
#	define GetEPDblBuf1Addr(ep)			GetEPRxAddr(ep)

#define SetEPCountRxReg(reg, count)	\
		do {\
			register uint16_t block;\
			if((count) <= 62) {\
				block = (((count) >> 1) + ((count) & 1 ? 1 : 0)) << 10;\
			} else {\
				block = ((((count) >> 5) - ((count) & 0x1F ? 0 : 1)) << 10) | 0x8000;\
			}\
			*(reg) = block;\
		} while (0)
#define SetEPTxCount(ep, count)			(*_pEPTxCount(ep) = (count))
#define SetEPRxCount(ep, count)			SetEPCountRxReg(_pEPRxCount(ep), (count))

#define SetEPTxAddr(ep, addr)			(*_pEPTxAddr(ep) = (((addr) >> 1) << 1))
#define SetEPRxAddr(ep, addr)			(*_pEPRxAddr(ep) = (((addr) >> 1) << 1))

#define SetEPDblBuf0Addr(ep, buf0addr)	SetEPTxAddr(ep, buf0addr)
#define SetEPDblBuf1Addr(ep, buf1addr)	SetEPRxAddr(ep, buf1addr)
#define SetEPDblBuffAddr(ep, buf0addr, buf1addr)\
			do {\
				SetEPDblBuf0Addr(ep, buf0addr);\
				SetEPDblBuf1Addr(ep, buf1addr);\
			} while (0)

#define GetEPTxCount(ep)				((uint16_t)(*_pEPTxCount(ep)) & 0x3ff)
#define GetEPRxCount(ep)				((uint16_t)(*_pEPRxCount(ep)) & 0x3ff)
#define GetEPDblBuf0Count(ep)			GetEPTxCount(ep)
#define GetEPDblBuf1Count(ep)			GetEPRxCount(ep)

#define SetEPDblBuf0Count(ep, in, count)\
		do {\
			if (in)\
				*_pEPTxCount(ep) = (uint32_t)(count);\
			else\
				SetEPCountRxReg(_pEPTxCount(ep), (count));\
		} while (0)
#define SetEPDblBuf1Count(ep, in, count)\
		do {\
			if (in)\
				*_pEPRxCount(ep) = (uint32_t)(count);\
			else\
				SetEPRxCount((ep), (count));\
		} while (0)
#define SetEPDblBuffCount(ep, in, count)\
		do {\
			SetEPDblBuf0Count((ep), (in), (count));\
			SetEPDblBuf1Count((ep), (in), (count));\
		} while (0)

#define SetEPTxStatus(ep, state)		\
		do {\
			register uint16_t _wRegVal = EP0REG[(ep)] & (EPREG_MASK | USB_EP0R_STAT_TX);\
			if((USB_EPTX_STAT_DTOG1 & state) != 0)\
				_wRegVal ^= USB_EPTX_STAT_DTOG1;\
			if((USB_EPTX_STAT_DTOG2 & state)!= 0)\
				_wRegVal ^= USB_EPTX_STAT_DTOG2;\
			SetEPReg(ep, _wRegVal);\
		} while (0)

#define SetEPRxStatus(ep, state)		\
		do {\
			register uint16_t _wRegVal = EP0REG[(ep)] & (EPREG_MASK | USB_EP0R_STAT_RX);\
			if((USB_EPRX_STAT_DTOG1 & state)!= 0) \
				_wRegVal ^= USB_EPRX_STAT_DTOG1;  \
			if((USB_EPRX_STAT_DTOG2 & state)!= 0) \
				_wRegVal ^= USB_EPRX_STAT_DTOG2;  \
			SetEPReg(ep, _wRegVal);\
		} while (0)

#define FreeUserBuffer(ep, in)			\
			do {\
				if (in)\
					ToggleDTOG_RX(ep);\
				else\
					ToggleDTOG_TX(ep);\
			} while (0)

