versaloon/vsf_orig/vsf/hal/cpu/gd32f1x0/usbd/GD32F1X0_USBD.c
#if VSFHAL_USBD_EN

#define GD32F1X0_USBD_EP_NUM					8
const uint8_t gd32f1x0_usbd_ep_num = GD32F1X0_USBD_EP_NUM;
struct vsfhal_usbd_callback_t gd32f1x0_usbd_callback;
static uint16_t EP_Cfg_Ptr = 0x200;

uint16_t gd32f1x0_usbd_IN_epsize[GD32F1X0_USBD_EP_NUM];
uint16_t gd32f1x0_usbd_OUT_epsize[GD32F1X0_USBD_EP_NUM];
bool gd32f1x0_usbd_IN_dbuffer[GD32F1X0_USBD_EP_NUM];
bool gd32f1x0_usbd_OUT_dbuffer[GD32F1X0_USBD_EP_NUM];
int8_t gd32f1x0_usbd_epaddr[GD32F1X0_USBD_EP_NUM];

vsf_err_t gd32f1x0_usbd_init(int32_t int_priority)
{
	struct gd32f1x0_info_t *gd32f1x0_info;
	
	memset(gd32f1x0_usbd_IN_epsize, 0, sizeof(gd32f1x0_usbd_IN_epsize));
	memset(gd32f1x0_usbd_OUT_epsize, 0, sizeof(gd32f1x0_usbd_OUT_epsize));
	memset(gd32f1x0_usbd_IN_dbuffer, 0, sizeof(gd32f1x0_usbd_IN_dbuffer));
	memset(gd32f1x0_usbd_OUT_dbuffer, 0, sizeof(gd32f1x0_usbd_OUT_dbuffer));
	memset(gd32f1x0_usbd_epaddr, -1, sizeof(gd32f1x0_usbd_epaddr));
	
	if (gd32f1x0_get_info(&gd32f1x0_info))
	{
		return VSFERR_FAIL;
	}
	
	// USBEN MUST BE disabled to configure the PHY clock
	RCC->APB1CCR &= ~RCC_APB1CCR_USBEN;
	RCC->GCFGR &= ~RCC_GCFGR_USBPS;
	switch (gd32f1x0_info->pll_freq_hz)
	{
	case 72 * 1000 * 1000:
		RCC->GCFGR |= RCC_GCFGR_USBPS_Div1_5;
		break;
	case 48 * 1000 * 1000:
		RCC->GCFGR |= RCC_GCFGR_USBPS_Div1;
		break;
	case 120 * 1000 * 1000:
		RCC->GCFGR |= RCC_GCFGR_USBPS_Div2_5;
		break;
	case 96 * 1000 * 1000:
		RCC->GCFGR |= RCC_GCFGR_USBPS_Div2;
		break;
	default:
		return VSFERR_INVALID_PARAMETER;
	}
	RCC->APB1CCR |= RCC_APB1CCR_USBEN;
	
	if (int_priority >= 0)
	{
		NVIC_SetPriority(USB_FS_LP_IRQn, int_priority & ((1 << __NVIC_PRIO_BITS) - 1));
		NVIC_SetPriority(USB_FS_HP_IRQn, int_priority & ((1 << __NVIC_PRIO_BITS) - 1));
		NVIC_EnableIRQ(USB_FS_LP_IRQn);
		NVIC_EnableIRQ(USB_FS_HP_IRQn);
	}
	
	// reset
	*CNTR = USB_CNTR_FRES;
	*CNTR = 0;
	
	// It seems that there MUST be at least 8 clock cycles
	// between clear FRES and clear ISTR, or RESET flash can't be cleared
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	*ISTR = 0;
	*CNTR = USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_ERRM |
				USB_CNTR_RESETM;
	*BTABLE = 0;
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_fini(void)
{
	// reset
	*CNTR = USB_CNTR_FRES;
	*ISTR = 0;
	
	*CNTR = USB_CNTR_FRES | USB_CNTR_PDWN;
	RCC->APB1CCR &= ~RCC_APB1CCR_USBEN;
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_reset(void)
{
	return VSFERR_NONE;
}

void USB_Istr(void);
vsf_err_t gd32f1x0_usbd_poll(void)
{
	USB_Istr();
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_connect(void)
{
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_disconnect(void)
{
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_set_address(uint8_t address)
{
	*DADDR = address | USB_DADDR_EF;
	return VSFERR_NONE;
}

uint8_t gd32f1x0_usbd_get_address(void)
{
	return *DADDR & USB_DADDR_ADD;
}

vsf_err_t gd32f1x0_usbd_suspend(void)
{
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_resume(void)
{
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_lowpower(uint8_t level)
{
	return VSFERR_NONE;
}

uint32_t gd32f1x0_usbd_get_frame_number(void)
{
	return *FNR & 0x7FF;
}

vsf_err_t gd32f1x0_usbd_get_setup(uint8_t *buffer)
{
	if (8 != gd32f1x0_usbd_ep_get_OUT_count(0))
	{
		return VSFERR_FAIL;
	}
	
	return gd32f1x0_usbd_ep_read_OUT_buffer(0, buffer, 8);
}

vsf_err_t gd32f1x0_usbd_prepare_buffer(void)
{
	EP_Cfg_Ptr = 0x200;
	return VSFERR_NONE;
}

static int8_t gd32f1x0_usbd_ep(uint8_t idx)
{
	uint8_t i;
	
	for (i = 0; i < sizeof(gd32f1x0_usbd_epaddr); i++)
	{
		if (idx == gd32f1x0_usbd_epaddr[i])
		{
			return (int8_t)i;
		}
	}
	return -1;
}

static int8_t gd32f1x0_usbd_get_ep(uint8_t idx)
{
	int8_t i;
	
	i = gd32f1x0_usbd_ep(idx);
	if (i >= 0)
	{
		return i;
	}
	
	for (i = 0; i < sizeof(gd32f1x0_usbd_epaddr); i++)
	{
		if (-1 == gd32f1x0_usbd_epaddr[i])
		{
			gd32f1x0_usbd_epaddr[i] = idx;
			SetEPAddress(i, idx);
			return i;
		}
	}
	return -1;
}

vsf_err_t gd32f1x0_usbd_ep_reset(uint8_t idx)
{
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_ep_set_type(uint8_t idx, enum vsfhal_usbd_eptype_t type)
{
	int8_t index;
	
	index = gd32f1x0_usbd_get_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	switch (type)
	{
	case USB_EP_TYPE_CONTROL:
		SetEPType(idx, EP_CONTROL);
		ClearStatusOut(idx);
		break;
	case USB_EP_TYPE_INTERRUPT:
		SetEPType(idx, EP_INTERRUPT);
		break;
	case USB_EP_TYPE_BULK:
		SetEPType(idx, EP_BULK);
		ClearEPDoubleBuff(idx);
		break;
	case USB_EP_TYPE_ISO:
		SetEPType(idx, EP_ISOCHRONOUS);
		break;
	default:
		return VSFERR_INVALID_PARAMETER;
	}
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_ep_set_IN_dbuffer(uint8_t idx)
{
	uint16_t epsize = gd32f1x0_usbd_ep_get_IN_epsize(idx);
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < GD32F1X0_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	EP_Cfg_Ptr -= epsize;
	
	SetEPDoubleBuff(idx);
	SetEPDblBuffAddr(idx, GetEPTxAddr(idx), EP_Cfg_Ptr);
	SetEPDblBuffCount(idx, true, 0);
	ClearDTOG_RX(idx);
	ClearDTOG_TX(idx);
	SetEPRxStatus(idx, USB_EPRX_STAT_DIS);
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	gd32f1x0_usbd_IN_dbuffer[idx] = true;
	return VSFERR_NONE;
}

bool gd32f1x0_usbd_ep_is_IN_dbuffer(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	return gd32f1x0_usbd_IN_dbuffer[idx];
}

vsf_err_t gd32f1x0_usbd_ep_switch_IN_buffer(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	FreeUserBuffer(idx, true);
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_ep_set_IN_epsize(uint8_t idx, uint16_t epsize)
{
	int8_t index;
	
	index = gd32f1x0_usbd_get_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < GD32F1X0_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	
	gd32f1x0_usbd_IN_epsize[idx] = epsize;
	SetEPTxCount(idx, epsize);
	// fix for 16-bit aligned memory
	EP_Cfg_Ptr -= epsize & 1 ? epsize + 1 : epsize;
	SetEPTxAddr(idx, EP_Cfg_Ptr);
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	return VSFERR_NONE;
}

uint16_t gd32f1x0_usbd_ep_get_IN_epsize(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return 0;
	}
	idx = (uint8_t)index;
	return gd32f1x0_usbd_IN_epsize[idx];
}

vsf_err_t gd32f1x0_usbd_ep_set_IN_stall(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	SetEPTxStatus(idx, USB_EPTX_STAT_STALL);
	return VSFERR_NONE;
}

vsf_err_t gd32f1x0_usbd_ep_clear_IN_stall(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	return VSFERR_NONE;
}

bool gd32f1x0_usbd_ep_is_IN_stall(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	
