versaloon/vsf_orig/vsf/hal/cpu/gd32f1x0/usbd/GD32F1X0_USBD.c
vsf_err_t gd32f1x0_usbd_ep_enable_OUT(uint8_t idx)
{
	int8_t index;
	
	index = gd32f1x0_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	SetEPRxStatus(idx, USB_EPRX_STAT_VALID);
	return VSFERR_NONE;
}






void CTR_LP(void)
{
	uint8_t EPindex;
	int8_t epaddr;
	uint16_t wIstr;
	volatile uint16_t wEPVal = 0;
	
	while (((wIstr = *ISTR) & USB_ISTR_CTR) != 0)
	{
		EPindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);
		epaddr = gd32f1x0_usbd_epaddr[EPindex];
		
		if (epaddr == 0)
		{
			if ((wIstr & USB_ISTR_DIR) == 0)
			{
				ClearEP_CTR_TX(0);
				if (gd32f1x0_usbd_callback.on_in != NULL)
				{
					gd32f1x0_usbd_callback.on_in(gd32f1x0_usbd_callback.param,
												epaddr);
				}
				return;
			}
			else
			{
				wEPVal = EP0REG[0];
				ClearEP_CTR_RX(0);
				if ((wEPVal & USB_EP0R_SETUP) != 0)
				{
					if (gd32f1x0_usbd_callback.on_setup != NULL)
					{
						gd32f1x0_usbd_callback.on_setup(gd32f1x0_usbd_callback.param);
					}
				}
				else if ((wEPVal & USB_EP0R_CTR_RX) != 0)
				{
					if (gd32f1x0_usbd_callback.on_out != NULL)
					{
						gd32f1x0_usbd_callback.on_out(gd32f1x0_usbd_callback.param,
													epaddr);
					}
				}
				return;
			}
		}
		else
		{
			wEPVal = EP0REG[EPindex];
			if ((wEPVal & USB_EP0R_CTR_RX) != 0)
			{
				ClearEP_CTR_RX(EPindex);
				if ((gd32f1x0_usbd_callback.on_out != NULL) && (epaddr >= 0))
				{
					gd32f1x0_usbd_callback.on_out(gd32f1x0_usbd_callback.param,
												epaddr);
				}
			}
			if ((wEPVal & USB_EP0R_CTR_TX) != 0)
			{
				ClearEP_CTR_TX(EPindex);
				if ((gd32f1x0_usbd_callback.on_in != NULL) && (epaddr >= 0))
				{
					gd32f1x0_usbd_callback.on_in(gd32f1x0_usbd_callback.param,
												epaddr);
				}
			}
		}
	}
}

void CTR_HP(void)
{
	uint8_t EPindex;
	int8_t epaddr;
	uint16_t wIstr;
	uint32_t wEPVal = 0;
	
	while (((wIstr = *ISTR) & USB_ISTR_CTR) != 0)
	{
		*ISTR = ~USB_ISTR_CTR;
		
		EPindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);
		epaddr = gd32f1x0_usbd_epaddr[EPindex];
		wEPVal = EP0REG[EPindex];
		if ((wEPVal & USB_EP0R_CTR_RX) != 0)
		{
			ClearEP_CTR_RX(EPindex);
			if ((gd32f1x0_usbd_callback.on_out != NULL) && (epaddr >= 0))
			{
				gd32f1x0_usbd_callback.on_out(gd32f1x0_usbd_callback.param, epaddr);
			}
		}
		else if ((wEPVal & USB_EP0R_CTR_TX) != 0)
		{
			ClearEP_CTR_TX(EPindex);
			if ((gd32f1x0_usbd_callback.on_in != NULL) && (epaddr >= 0))
			{
				gd32f1x0_usbd_callback.on_in(gd32f1x0_usbd_callback.param, epaddr);
			}
		}
	}
}

void USB_Istr(void)
{
	uint16_t wIstr = *ISTR;
	
	if (wIstr & USB_ISTR_RESET)
	{
		*ISTR = ~USB_ISTR_RESET;
		if (gd32f1x0_usbd_callback.on_reset != NULL)
		{
			gd32f1x0_usbd_callback.on_reset(gd32f1x0_usbd_callback.param);
		}
	}
	if (wIstr & USB_ISTR_PMAOVR)
	{
		*ISTR = ~USB_ISTR_PMAOVR;
	}
	if (wIstr & USB_ISTR_ERR)
	{
		*ISTR = ~USB_ISTR_ERR;
		if (gd32f1x0_usbd_callback.on_error != NULL)
		{
			gd32f1x0_usbd_callback.on_error(gd32f1x0_usbd_callback.param,
											USBERR_ERROR);
		}
	}
	if (wIstr & USB_ISTR_WKUP)
	{
		*ISTR = ~USB_ISTR_WKUP;
		if (gd32f1x0_usbd_callback.on_wakeup != NULL)
		{
			gd32f1x0_usbd_callback.on_wakeup(gd32f1x0_usbd_callback.param);
		}
	}
	if (wIstr & USB_ISTR_SUSP)
	{
		if (gd32f1x0_usbd_callback.on_suspend != NULL)
		{
			gd32f1x0_usbd_callback.on_suspend(gd32f1x0_usbd_callback.param);
		}
		*ISTR = ~USB_ISTR_SUSP;
	}
	if (wIstr & USB_ISTR_SOF)
	{
		*ISTR = ~USB_ISTR_SOF;
#if 0
		if (gd32f1x0_usbd_callback.on_sof != NULL)
		{
			gd32f1x0_usbd_callback.on_sof(gd32f1x0_usbd_callback.param);
		}
#endif
	}
	if (wIstr & USB_ISTR_ESOF)
	{
		*ISTR = ~USB_ISTR_ESOF;
#if 0
		if (gd32f1x0_usbd_callback.on_error != NULL)
		{
			gd32f1x0_usbd_callback.on_error(gd32f1x0_usbd_callback.param,
											USBERR_SOF_TO);
		}
#endif
	}
	if (wIstr & USB_ISTR_CTR)
	{
		CTR_LP();
	}
}

ROOTFUNC void USB_LP_IRQHandler(void)
{
	USB_Istr();
}

ROOTFUNC void USB_HP_IRQHandler(void)
{
	CTR_HP();
}

ROOTFUNC void USBWakeUp_IRQHandler(void)
{
}

#endif
